# AttachedGroupNoMirror Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..GroupFailures..::..AttachedGroupNoMirror Property
BuiltInFailures..::..GroupFailures Class See Also
---
Attached detail groups cannot be mirrored without also mirroring their parent group.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId AttachedGroupNoMirror { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property AttachedGroupNoMirror As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ AttachedGroupNoMirror {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..GroupFailures Class
Autodesk.Revit.DB Namespace